Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཚེ་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དྲང་སྲོང་ལྷ་བཟང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་དག་གི་འདོད་ཆགས་དང་བྲལ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king and sage known as Excellent God. He possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་ནས་རྒྱལ་པོ་དྲང་སྲོང་ལྷ་བཟང་གཅིག་པུ་དབེན་པར་སོང་སྟེ།
en: “This king and sage, Excellent God, went into solitude.

source: ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས་འདི་སྙམ་དུ་སེམས་སོ། །
en: Practicing meditation in his retreat, he wondered,

source: བདག་གིས་འདིར་སེམས་ཅན་དག་འཆི་བ་དང་། སྐྱེ་བ་དང་། ངན་པ་དང་། བཟང་པོ་དང་། བདེ་འགྲོ་དང་། ངན་འགྲོར་འགྲོ་བ་མཐོང་བ་དེའི་རྒྱུ་ནི་གང་རྐྱེན་ནི་
en: ‘I see sentient beings who die and are born, taking unfortunate or happy paths, going to the higher or the lower realms. What might be the causes and conditions for that?

source: གང་ཡིན་གང་གིས་སེམས་ཅན་དེ་དག་ལུས་གཅིག་པོ་ཤི་ནས་སྐྱེ་བ་ཞེས་བྱ་བ་སྣང་སྟེ
en: Why does it appear that they take rebirth again after their body in a given life has died?

source: ལ་ལ་ནི་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ། ལ་ལ་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ། ལ་ལ་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ། ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་རིས་སུ།
en: Some are born in hells, some among the animals, and some in the realms of the Lord of Death, and some are born in the realms of demigods.

source: ལ་ལ་ནི་ཚངས་པར། ལ་ལ་ནི་རྒྱལ་རིགས་སུ། ལ་ལ་ནི་རྗེའུ་རིགས་སུ། ལ་ལ་ནི་དམངས་རིགས་སུ།
en: Some are born as brahmins, some as royalty, some as merchants, and some as commoners.

source: ལ་ལ་ནི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་རྒྱལ་པོ་ལྷ་རྣམས་སུ། ལ་ལ་ནི་ལྷ་མཐུ་བོ་ཆེ། ལ་ལ་ནི་ལྷའི་རྒྱལ་པོའི་ཡོངས་སུ་སྤྱོད་པ་པ།
en: Some are born as gods in the realms of the four great kings, some as powerful gods, and some live as king of the gods.

source: ལ་ལ་ནི་སུམ་ཅུ་རྩ་གསུམ་དུ། ལ་ལ་ནི་འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་སུ།
en: Some take birth in the Heaven of the Thirty-Three, some in the Heaven Free from Strife, some in the Heaven of Joy, some in the Heaven of Delighting in Emanations, and some in the Heaven of Making Use of Others’ Emanations.

source: ལ་ལ་ནི་མི་ལས་ཤི་ནས་ཚངས་པར་སྐྱེ།
en: Some leave the human realm to be born as Brahmā.

source: ལ་ལ་ནི་ཚངས་རིས་དང་ཚངས་པའི་མདུན་ན་འདོན་དང་ཚངས་འཁོར་དང་། ཚངས་པ་ཆེན་པོ་རྣམས་སུ།
en: Some are born in the Realm of Brahmā, the Heaven of the High Priests of Brahmā, or the Heaven of the Retinue of Brahmā, and some are born in the Heaven of Great Brahmā.

source: དེ་བཞིན་དུ་འོད་དང་འོད་ཆུང་དང་ཚད་མེད་འོད་དང་འོད་གསལ་ནས་དགེ་རྒྱས་ཀྱི་བར་དུའོ། །
en: Others are born in the Heaven of Light, the Heaven of Limited Light, the Heaven of Limitless Light, the Luminous Heaven, and so forth, up to the Heaven of Perfected Virtue.

source: ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་།
en: Some are born in the Greater Heaven, the Heaven of Lesser Greatness, the Heaven of Limitless Greatness, and the Heaven of Great Fruition.

source: འདུ་ཤེས་མེད་པའི་སེམས་ཅན་དང་།
en: Some are born among the beings who do not have any notions.

source: མི་ཆེ་བ་དང་མི་གདུང་བ་ནས་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་དུ་སྐྱེ།
en: Some are born in the Unlofty Heaven, the Heaven of No Hardship, and so forth, up to the gods of the Highest Heaven.

source: ལ་ལ་ནི་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དུ། ལ་ལ་ནི་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དུ། ལ་ལ་ནི་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེའོ་སྙམ་མོ། །
en: Still others are born as gods in the fields of infinite space, infinite consciousness, and neither notion nor no notion.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཉོན་མོངས་པའི་བྱེ་བྲག་དང་། ལས་ཀྱི་བྱེ་བྲག་དང་། སྐྱེ་བའི་བྱེ་བྲག་ལས་གཞན་མ་ཡིན་ཏེ།
en: “Having inquired in this way Excellent God then thought, ‘The causes and conditions are nothing other than specific afflictions, specific actions, and specific forms of birth.

source: ཉོན་མོངས་པའི་རྒྱུ་མངོན་པར་གྲུབ་ན་ལས་ཀྱི་རྒྱུ་མངོན་པར་གྲུབ་ཅིང་། ལས་ཀྱི་རྒྱུ་སྐྱེའོ་སྙམ་མོ། །
en: When the causal afflictions are present there will be causal actions, and those will bring birth.

source: གལ་ཏེ་ཉོན་མོངས་པར་མ་གྱུར་ན་ལས་མངོན་པར་འདུ་བྱེད་པར་མི་འགྱུར་ལས་མངོན་པར་འདུ་བྱེད་པ་མེད་ན་སྐྱེ་བར་མི་འགྱུར་རོ་སྙམ་མོ། །
en: However, if one is not afflicted there will not be any formations, and without formations there will not be birth.

source: འདི་ལས་གོང་ན་ཆེས་ཞི་བའམ། ཆེས་གྱ་ནོམ་པ་ཅི་ཡོད་སྙམ་མོ། །
en: What could be more serene, what could be more sublime, than this!’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱས་པས་འདུ་ཤེས་ཀྱི་ཚོར་བ་འགགས་ཤིང་སྙོམས་པར་འཇུག་པ་དག་ལ་སེམས་རབ་ཏུ་འཇོག་གོ། །
en: “With this understanding Excellent God entered equipoise within the cessation of sensations related to notions.

source: དེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་ཀྱི་ཚོར་བ་འགགས་ཤིང་སྙོམས་པར་འཇུག་པ་ལ་ཉེ་བར་ཞུགས་སོ། །
en: Going beyond all the fields of neither notion nor no notion, he entered equipoise within the cessation of sensations related to notions.

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་དབུགས་ཕྱུང་སྟེ། སྡུག་བསྔལ་འདི་ལས་ངེས་པར་འབྱུང་བ་ཡོད་དོ་སྙམ་ནས།
en: As he emerged from his absorption, Excellent God was deeply relieved and he thought, ‘It is indeed possible to break free from this suffering!’

source: དེའི་ཚེ་སྐྱེ་བོའི་ཚོགས་མང་པོའི་ནང་དུ་འདུག་ནས་འདུ་ཤེས་ཀྱི་ཚོར་བ་འགོག་པ་ལ་སྙོམས་པར་འཇུག་པ་སྟོན།
en: “Thereafter, seated in the midst of many beings, Excellent God taught the way to enter equipoise within the cessation of sensations related to notions.

source: གྲོགས་པོ་དག་གང་ཏིང་ངེ་འཛིན་འདི་ལྟ་བུ་ཤེས་ན་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་། མ་རྟོགས་པ་ཡང་རྟོགས་པར་འགྱུར་རོ། །
en: ‘Friends,’ he explained, ‘once you comprehend this form of absorption your attainment of the bodhisattva’s qualities will become irreversible, and you will realize what you have not yet realized.’

source: དེའི་ཚེ་དེའི་འཁོར་བཞི་པོ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: At that point the fourfold retinue became irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་ལྷ་བཟང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ་ང་དེར་གྱུར་ཏོ། །
en: “Maudgalyāyana, in case you may think that at that time the king and sage Excellent God was anyone else, do not, because I was him.

source: ངས་འཁོར་བཞི་པོ་དེ་དག་འདུ་ཤེས་ཀྱི་ཚོར་བ་འགོག་པ་ལ་སྙོམས་པར་འཇུག་པ་ཐོས་ནས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Thus, as I introduced my fourfold retinue to the equipoise of the cessation of sensations as related to notions, they reached the irreversible stage.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་འདུ་བྱེད་དག་ལས་ངེས་པར་འབྱུང་བར་བལྟ་བར་བྱའོ། །
en: “Therefore, Maudgalyāyana, when practicing bodhisattva activities, bodhisattvas must consider how to go beyond formation.

source: འདུ་བྱེད་དག་ལས་ངེས་པར་འབྱུང་བར་ལྟ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལས་ཀྱི་སྒྲིབ་པ་རི་རབ་ཙམ་ཡོད་ཀྱང་སེམས་བསྐྱེད་པ་གཅིག་གིས་སེལ་བར་བྱེད། འཇིག་པར་བྱེད། འཐོར་བར་བྱེད། འཇོམས་པར་བྱེད་དོ། །
en: A bodhisattva who considers how to go beyond formation will, just by bringing forth the mind of awakening a single time, be able to purify karmic obscurations, even if they are as gigantic as Mount Sumeru. All such obscurations will be destroyed, dispersed, and annihilated.

source: མཽད་གལ་གྱི་བུ་ངས་ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས་མངོན་པར་འདུས་བྱས་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the future.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཆེན་པོ་བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a great brahmin and sage known as Divine Master.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པའི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: He possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: དེས་བསམ་གཏན་དང་པོ་ལ་གནས་ནས་མངོན་པར་ཤེས་པ་ལྔ་བསྒྲུབས་སོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Resting in the first concentration he achieved the five superknowledges, and so he thought to himself,

source: བསམ་གཏན་དང་པོ་ལ་གནས་ན་འདུ་བྱེད་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བ་རྗེས་སུ་འཐོབ་པར་ནུས་སོ་སྙམ་མོ། །
en: ‘By dwelling in the first concentration one becomes capable of achieving deliverance beyond all karmic formation.

source: བསམ་གཏན་དང་པོ་འདི་ལ་རོ་མྱང་བར་བྱ་བ་ཡོད།
en: This first concentration should be experienced,

source: ཉེས་དམིགས་ཡོད།
en: but it also has shortcomings,

source: ངེས་པར་འབྱུང་བ་ཡོད་ཅིང་།
en: and there is deliverance beyond it.

source: དེ་འདིར་རོ་མྱང་བ་དང་ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བ་དམིགས་ཏེ། དེ་ལ་འདུ་བྱེད་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བ་ཡོད་དོ། །
en: By recognizing experience, shortcomings, and deliverance in this context, one may attain deliverance beyond all karmic formation.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པའི་གཞི་གཅིག་ལ་ངེས་པར་འབྱུང་བ་ཕུན་སུམ་ཚོགས་པ་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་ངེས་པར་འབྱུང་བ་མིག་གི་སྐྱེ་མཆེད་ལ་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་ངེས་པར་འབྱུང་བ་ནས། ཡིད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་བར་དུའོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ཀྱི་སྐྱེ་མཆེད་ལ་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་ངེས་པར་འབྱུང་བ་ཡོད་དོ། །
en: The perfect deliverance that is based exclusively on the teaching of the blessed buddhas always concerns experience, shortcomings, and deliverance. Thus, there is experience, shortcomings, and deliverance related to the sense source of the eye up to the sense source of the mind, just as there is experience, shortcomings, and deliverance up to and including the sense sources of smell, taste, tactility, and mental phenomena.

source: དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་ལ་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་། ངེས་པར་འབྱུང་བར་རྣམ་པར་རིག་པར་བྱའོ་སྙམ་མོ། །
en: Therefore, bodhisattvas must be aware that there is experience, shortcomings, and deliverance with regard to any phenomenon.’

source: ད་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན་དེས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: “By correctly keeping this in mind the sage gained acceptance that phenomena are unborn.

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་གྲོང་དང་གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་འདུག་སྟེསེམས་ཅན་རྣམས་ལ་མི་སྐྱེ་བའི་བཟོད་པ་ཐོབ་པའི་ཆོས་སྟོན་པ་ན་དེས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་བཟོད་པ་ལ་བཙུད་དོ། །
en: When he arose from his absorption he went on to visit villages, towns, cities, and royal palaces, thus teaching the beings there the Dharma of acceptance that phenomena are unborn. In this way he established innumerably many tens of thousands of beings in the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the brahmin and sage Divine Master was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that brahmin and sage Divine Master,

source: ངས་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: and in this way I established innumerably many tens of thousands of beings in the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པ་ལ་མངོན་པར་བརྩོན་པར་བྱ། གཞན་དག་ལ་ཡང་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must endeavor to attain acceptance that phenomena are unborn, and they must also teach the Dharma to others so that they gain that acceptance.

source: མཽད་གལ་གྱི་བུ་ངས་ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, I have created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of the future. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the future.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་གདོལ་པ་ཡིད་འོང་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Delightful Outcaste.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ། མཐུ་ཆེ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་ངོ་། །
en: He was endowed with tremendous miraculous powers and splendor, and he had attained the five superknowledges.

source: དེ་ནས་གཅིག་པུ་དབེན་པར་སོང་ནས་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ཏེ། དེ་འདི་སྙམ་དུ་སེམས་སོ། །
en: The sage went into solitude, and while thus practicing meditation he thought,

source: ཆོས་འདི་དག་ལ་རིགས་དང་རུས་སུ་བརྟག་པ་མེད་དེ།
en: ‘These phenomena do not lend themselves to concepts of class and family.

source: ཆོས་ཉིད་ལ་ཆོས་སུ་བརྟག་པ་མེད་ཅིང་ཆོས་མ་ཡིན་པ་ཡང་མེད།
en: In reality there is nothing to conceive of as phenomena or non-phenomena.

source: ཆོས་འདི་དག་ལ་ཡོན་ཏན་ཉིད་ཀྱིས་བརྟག་པ་མེད་ཅིང་ཡོན་ཏན་མ་ཡིན་པ་ཡང་མེད།
en: Phenomena should also not be considered in terms of good or bad qualities.

source: གང་དང་གང་དུ་ཆོས་དམིགས་པ་ཉིད་དེ་ཆོས་གནས་པ་ཞེས་བྱ་སྟེ།
en: So-called phenomena are just whatever focal points one may hold.

source: ཡོན་ཏན་ནི་གང་ཡིན་ཡོན་ཏན་མ་ཡིན་པ་ནི་གང་ཡིན།
en: What are good qualities? What are bad qualities?

source: གང་འཆི་བའི་ཚེ་སེམས་འགྱོད་པ་དེ་ནི་ཡོན་ཏན་མ་ཡིན་ནོ། །
en: Regret on the verge of death is not a good quality.

source: གང་འཆི་བའི་ཚེ་སེམས་བདེ་བ་དེ་ནི་ཡོན་ཏན་ནོ། །
en: A mind at ease at the time of death is a good quality.

source: དེ་ལྟ་བས་ན་མཁས་པས་ལས་མངོན་པར་འདུ་བྱེད་ན་ལས་དེ་མངོན་པར་འདུ་བྱའོ། །
en: Thus, acts that should be performed are those that a wise being would engage in.

source: གང་སེམས་བདེ་བ་མངོན་པར་འདུ་བྱེད་པ་དེ་ནི་སྐྲག་པ་མེད་ཅིང་དངངས་པར་མི་འགྱུར་རོ། །
en: The one who practices with ease of mind will know no fears or dreads.’

source: སྙམ་ནས་དེའི་ཚེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ་སོང་སྟེ། སེམས་ཅན་དེ་དག་ལ་སྒྲ་དབྱངས་འདི་སྐད་བསྒྲགས་སོ། །
en: “The sage then arose from his absorption. Journeying throughout the ten directions, he would declare to sentient beings,

source: མཁས་པ་དག་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་མི་སྐྲག་མི་དངང་། དངང་བར་མི་འགྱུར་ཏེ།
en: “The wise are not frightened or intimidated by phenomena that do not arise.

source: གང་འདི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་དེ་དག་ནི་སྐྲག་པར་རིག་པར་བྱའོ། །
en: Yet childish, ordinary beings who have not received teaching ought to be afraid.

source: ཆོས་ཀྱི་ངོ་བོ་གང་ཡང་མི་དམིགས་ཏེ།
en: No essence of any phenomenon at all can be observed.

source: གང་ངོ་བོ་ཉིད་ཅན་དང་། གང་ངོ་བོ་ཉིད་མེད་པ་དེ་ལ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་དོ། །
en: That which has an essence and that which has no essence are both beyond arising and ceasing.

source: དེ་ལ་གང་བཟོད་པར་འདོད་པ་ཕྱོགས་གཅིག་ངེས་པར་ཁས་ལེན་པ་འདི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཞེས་བྱའོ། །
en: The one who can commit to this and assert it unequivocally is said to have gained “acceptance that phenomena are unborn.”

source: དེ་ལ་ཁྱེད་ཅག་མ་སྐྲག་མ་དངང་དངས་པར་མ་བྱེད་ཅིག །
en: You people, do not be frightened or afraid.

source: བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་མ་སྤྱོད་མ་འཇུག་ཤིག །
en: Do not engage with and do not pursue the domain of the māras.

source: གང་ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་ལ་ཡང་དག་པར་ཁས་ལེན་པ་དེ་ནི་བདུད་ཀྱི་སྤྱོད་ཡུལ་ཡིན་ནོ། །
en: Whenever something uunreal is claimed to be real, then that is the domain of the māras.

source: ངས་ཆོས་དེ་བཤད་པ་ན་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Through this teaching of mine innumerable tens of thousands of beings have attained acceptance that phenomena are unborn and become irreversible from unsurpassed and perfect awakening.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གདོལ་པ་ཡིད་འོང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Delightful Outcaste was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གདོལ་པ་ཡིད་འོང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was that sage Delightful Outcaste

source: ངས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: and so I established innumerable tens of thousands of beings in the acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་པར་བྱ། དེ་ཡང་སྐྱེ་བོའི་ཚོགས་མང་པོ་དག་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings must teach the Dharma for the sake of the acceptance that phenomena are unborn and they must induce that understanding in numerous gatherings of beings.”

source: མཽད་གལ་གྱི་བུ་ངས་འཆི་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་འཆི་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand death. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of death.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དྲང་སྲོང་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king and sage known as Sāgaramati.

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ་ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ལ་འདོད་ཆགས་དང་བྲལ་བ། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བར་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: He possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: བདག་ཅིའི་ཕྱིར་ནགས་ཚལ་ན་དོན་མེད་པར་གནས།
en: ‘Why should I remain in the forest for no reason?

source: གང་བདག་གིས་ནགས་ཚལ་འདི་དག་ཐམས་ཅད་རྒྱུ་གསུམ་དུ་གཞག་པར་བྱ་སྟེ།
en: I shall divide the forest in terms of three causes.

source: གང་རླུང་ནད་ཅན་དེ་དག་ལ་ནགས་ཚལ་གྱི་ཆ་གཅིག་གཞག་པར་བྱ།
en: Thus, one part of the forest shall be for those who suffer from wind diseases,

source: གང་བད་ཀན་ཅན་དེ་དག་ལ་ཆ་གཉིས་གཞག་པར་བྱ།
en: another shall be for those suffering from phlegm ailments,

source: གང་མཁྲིས་ནད་ཅན་དེ་དག་ལ་ཆ་གསུམ་པ་གཞག་པར་བྱའོ་སྙམ་མོ། །
en: and a third part of the forest shall be allocated for those afflicted by bile disorders.’

source: གང་བདག་གིས་ནགས་ཚལ་དེ་དག་ཐམས་ཅད་དུ་རོ་བཙལ་བར་བྱ་བ་མཐོང་ནས་
en: ‘I shall travel through all parts of the forest to determine the different tastes of the trees.

source: རོ་འདི་དག་ནི་སྐྱུར་བ་དང་། ལན་ཚྭ་དང་། མངར་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། བསྐ་བའོ། །
en: Some trees may be sour, others salty, still others sweet, and some may be bitter, hot, or astringent.

source: ནགས་ཚལ་ནི་གང་ཡིན་རོར་བརྩི་བ་ནི་གང་ཡིན་སྙམ་མོ། །
en: Which are the relevant parts of the forest? What tastes do the trees hold?’

source: དེའི་ཚེ་དེ་ལ་ནགས་ཚལ་གྱི་ལྷ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐལ་མོ་སྦྱར་ནས་མངོན་པར་སོང་སྟེ།
en: “At that time the gods of the forest came before him with joined palms.

source: དེའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། རང་རང་གི་རོ་བརྗོད་དེ།
en: Bowing their heads to the sage’s feet, they each conveyed their tastes to him.

source: གང་ཤིང་གི་ནགས་ཚལ་གྱི་རོ་སྐྱུར་བ་འཆང་བ་དེ་དག་སྐྱུར་བ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were sour, [salty, bitter, hot, astringent, or sweet.]

source: གང་དག་ལན་ཚྭའི་རོ་འཆང་བ་དེ་དག་ལན་ཚྭའི་རོ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were [sour,] salty, [bitter, hot, astringent, or sweet.]

source: གང་དག་རོ་ཁ་བ་འཆང་བ་དེ་དག་རོ་ཁ་བ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were [sour, salty,] bitter, [hot, astringent, or sweet.]

source: གང་དག་རོ་ཚ་བ་འཆང་བ་དེ་དག་རོ་ཚ་བ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were [sour, salty, bitter,] hot, [astringent, or sweet.]

source: གང་དག་རོ་བསྐ་བ་འཆང་བ་དེ་དག་རོ་བསྐ་བ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were [sour, salty, bitter, hot,] astringent, [or sweet.]

source: གང་དག་རོ་མངར་བ་འཆང་བ་དེ་དག་རོ་མངར་བ་སྨྲའོ། །
en: Thus, they explained to the sage where in the forest the trees held tastes that were [sour, salty, bitter, hot, astringent, or] sweet.

source: ནགས་ཚལ་བ་རྣམས་ཀྱིས་ནི་རང་རང་གི་རོ་ཇི་ལྟ་བ་བཞིན་སྨྲས་ན་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཀུན་ནས་ལྡང་བ་དུ་ཞིག་ཡོད་སྙམ་མོ། །
en: ‘The different parts of the forest have accurately revealed their tastes to me. Now, how many disorders afflict sentient beings?

source: སེམས་ཅན་རྣམས་ཀྱི་ནད་ཀུན་ནས་ལྡང་བ་ནི་བཞི་སྟེ། རླུང་ནད་དང་། མཁྲིས་ནད་དང་། བད་ཀན་དང་འདུས་པའོ། །
en: There are four types of disorder that afflict sentient beings: wind diseases, bile diseases, phlegm diseases, and their combinations.

source: དེ་བསྡུ་ན་དོན་གསུམ་སྟེ། རླུང་ནད་དང་མཁྲིས་ནད་དང་བད་ཀན་ནོ། །
en: These four may further be included in the three kinds of illness associated with wind, bile, and phlegm.

source: གང་འདུས་པ་ནི་རླུང་ནད་དང་མཁྲིས་ནད་དང་བད་ཀན་དང་བཅས་པའོ། །
en: The combinations are those of wind, bile, and phlegm.’

source: དེ་ལ་ནགས་ཚལ་གྱི་སྐྱུར་བ་དང་། བསྐ་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད། ནགས་ཚལ་གྱི་སྐྱུར་བ་དང་། ཁ་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད། ནགས་ཚལ་གྱི་སྐྱུར་བ་དང་ཚ་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད། ནགས་ཚལ་གྱི་སྐྱུར་བ་དང་ལན་ཚྭའི་རོ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད། ནགས་ཚལ་གྱི་སྐྱུར་བ་དང་། མངར་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད།
en: “Sāgaramati then determined which parts of the forest were sour and bitter, sour and astringent, sour and hot, sour and salty, sour and sweet, salty and astringent, and so forth, through to bitter and sour.

source: ནགས་ཚལ་གྱི་དེ་བཞིན་དུ་སྦྱར་ཏེ། བསྐ་བ་དང་སྐྱུར་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད། ནགས་ཚལ་གྱི་བསྐ་བ་དང་ལན་ཚྭ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། མངར་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད་དེ། ནགས་ཚལ་གྱི་རོར་བརྩི་བ་གང་ཡིན་པ་དེ་དག་རྣམ་པར་འབྱེད་དོ། །
en: In this way he also distinguished the different parts of the forest in terms of bitter, salty, astringent, hot, and sweet—determining which parts would contain which tastes.

source: དེ་སེམས་ཅན་གྱི་རང་བཞིན་ཡང་རིག་ནགས་ཚལ་གྱི་རང་བཞིན་ཡང་རིག་ནས། གསོ་བའི་དཔྱད་ཤེས་པ་སྦྱར་རོ། །
en: With knowledge of the different types of beings and the different types of forest, he then began the study of medicine.

source: དེ་ལ་ནད་པའི་ཕྱོགས་གསུམ་སྟེ། ངེས་པར་འཆི་བའི་ཆོས་དང་། འཚོ་བའི་ཆོས་དང་གསུམ་པ་སྟེ་མ་གསོས་ན་འཆི་བའོ། །
en: ‘There are three types of disease: those that are fatal, those that one survives, and those that are fatal unless treated.

source: དེ་ལ་སྨན་པ་མཁས་པས་གསོ་སྨན་སྦྱར་བར་བྱ་སྟེ།
en: These are the types of disease that a skilled doctor must treat with medicine.

source: འཚོ་བའི་ཆོས་ལ་མ་འོངས་པའི་སྡུག་བསྔལ་གྱི་ཚོར་བས་ཉམ་ཐག་པར་འགྱུར་བའི་ཕྱིར་གསོ་སྨན་སྦྱར་བར་བྱ།
en: With regard to the diseases that one survives, one must dispense medicine to avoid future agony.
